In [16]:
import pandas as pd
import numpy as np

In [17]:
lst =['A','B','C']
lst = np.array(lst)

In [18]:
lst2 = ['a','b','c']

In [19]:
pd.Series(lst,lst2)

a    A
b    B
c    C
dtype: object

In [20]:
pd.Series(data = lst,index=lst2)

a    A
b    B
c    C
dtype: object

In [21]:
d = {'a':'A','b':'B','c':'C'}

In [22]:
pd.Series(d)

a    A
b    B
c    C
dtype: object

In [23]:
fam = ['raja','rajeshwari','dhivya','dinesh']

In [24]:
s1 = pd.Series(fam,index =[1,2,3,4])

In [25]:
s1

1          raja
2    rajeshwari
3        dhivya
4        dinesh
dtype: object

In [122]:
gf = ['ragul','sound','dinesh','surya']

In [123]:
s2 = pd.Series(gf)

In [124]:
s2

0     ragul
1     sound
2    dinesh
3     surya
dtype: object

In [125]:
gf1 = pd.Series([1,2,3,4],index = ['ragul','sound','dinesh','surya'])

In [126]:
gf1

ragul     1
sound     2
dinesh    3
surya     4
dtype: int64

In [127]:
gf2 = pd.Series([1,2,4,5],index = ['ragul','vicky','dinesh','surya'])

In [128]:
gf2

ragul     1
vicky     2
dinesh    4
surya     5
dtype: int64

In [129]:
gf1+gf2

dinesh    7.0
ragul     2.0
sound     NaN
surya     9.0
vicky     NaN
dtype: float64

In [34]:
from numpy.random import randn

In [35]:
df = pd.DataFrame(randn(5,5),index =('A','B','C', 'D', 'E'),columns = 'P Q R S T'.split())

In [36]:
df

          P         Q         R         S         T
A  0.431270  1.192686 -0.109203  0.570102  0.892391
B -2.114891  1.591057 -0.088394  1.236522 -0.776269
C  1.143432  1.012306  0.966802  1.176011 -0.139158
D -0.230961 -0.943435 -2.819618 -2.679666 -1.043140
E -0.598942 -0.787023  0.088974  0.159062 -0.616390

In [37]:
type(df['P'])

pandas.core.series.Series

In [38]:
df['P']

A    0.431270
B   -2.114891
C    1.143432
D   -0.230961
E   -0.598942
Name: P, dtype: float64

In [39]:
df[['P','R']]

          P         R
A  0.431270 -0.109203
B -2.114891 -0.088394
C  1.143432  0.966802
D -0.230961 -2.819618
E -0.598942  0.088974

In [40]:
type(df[['P','R']])

pandas.core.frame.DataFrame

In [41]:
df['U'] = df['P'] - df['Q']

In [42]:
df

          P         Q         R         S         T         U
A  0.431270  1.192686 -0.109203  0.570102  0.892391 -0.761416
B -2.114891  1.591057 -0.088394  1.236522 -0.776269 -3.705948
C  1.143432  1.012306  0.966802  1.176011 -0.139158  0.131126
D -0.230961 -0.943435 -2.819618 -2.679666 -1.043140  0.712474
E -0.598942 -0.787023  0.088974  0.159062 -0.616390  0.188080

# axis =0 means to access a row
# axis =1 means to access a columns

## inplace : to give inplace confirmly drop (column or row)

In [43]:
df.drop('U',axis = 1,inplace = True)

In [44]:
df

          P         Q         R         S         T
A  0.431270  1.192686 -0.109203  0.570102  0.892391
B -2.114891  1.591057 -0.088394  1.236522 -0.776269
C  1.143432  1.012306  0.966802  1.176011 -0.139158
D -0.230961 -0.943435 -2.819618 -2.679666 -1.043140
E -0.598942 -0.787023  0.088974  0.159062 -0.616390

In [45]:
df.drop('C',axis = 0)

          P         Q         R         S         T
A  0.431270  1.192686 -0.109203  0.570102  0.892391
B -2.114891  1.591057 -0.088394  1.236522 -0.776269
D -0.230961 -0.943435 -2.819618 -2.679666 -1.043140
E -0.598942 -0.787023  0.088974  0.159062 -0.616390

In [46]:
df

          P         Q         R         S         T
A  0.431270  1.192686 -0.109203  0.570102  0.892391
B -2.114891  1.591057 -0.088394  1.236522 -0.776269
C  1.143432  1.012306  0.966802  1.176011 -0.139158
D -0.230961 -0.943435 -2.819618 -2.679666 -1.043140
E -0.598942 -0.787023  0.088974  0.159062 -0.616390

# if u want use row means use loc eg:(df.loc['B'])

# if u want use index means use iloc eg:(df.iloc[1])

In [47]:
d = df.loc[[df[]'' == 'E']]

SyntaxError: invalid syntax (3711172206.py, line 1)

In [48]:
df.loc['B']

P   -2.114891
Q    1.591057
R   -0.088394
S    1.236522
T   -0.776269
Name: B, dtype: float64

In [49]:
df.iloc[1]

P   -2.114891
Q    1.591057
R   -0.088394
S    1.236522
T   -0.776269
Name: B, dtype: float64

In [50]:
df.iloc[0:,:2]

          P         Q
A  0.431270  1.192686
B -2.114891  1.591057
C  1.143432  1.012306
D -0.230961 -0.943435
E -0.598942 -0.787023

In [51]:
df.iloc[0:,:1]

          P
A  0.431270
B -2.114891
C  1.143432
D -0.230961
E -0.598942

In [52]:
df.loc[['A','B'],['P','Q']]

          P         Q
A  0.431270  1.192686
B -2.114891  1.591057

# to find a less than 0 or greater than 0 value

In [53]:
df > 0

       P      Q      R      S      T
A   True   True  False   True   True
B  False   True  False   True  False
C   True   True   True   True  False
D  False  False  False  False  False
E  False  False   True   True  False

In [54]:
df

          P         Q         R         S         T
A  0.431270  1.192686 -0.109203  0.570102  0.892391
B -2.114891  1.591057 -0.088394  1.236522 -0.776269
C  1.143432  1.012306  0.966802  1.176011 -0.139158
D -0.230961 -0.943435 -2.819618 -2.679666 -1.043140
E -0.598942 -0.787023  0.088974  0.159062 -0.616390

In [55]:
df[df>0]

          P         Q         R         S         T
A  0.431270  1.192686       NaN  0.570102  0.892391
B       NaN  1.591057       NaN  1.236522       NaN
C  1.143432  1.012306  0.966802  1.176011       NaN
D       NaN       NaN       NaN       NaN       NaN
E       NaN       NaN  0.088974  0.159062       NaN

In [56]:
df[df<0]

          P         Q         R         S         T
A       NaN       NaN -0.109203       NaN       NaN
B -2.114891       NaN -0.088394       NaN -0.776269
C       NaN       NaN       NaN       NaN -0.139158
D -0.230961 -0.943435 -2.819618 -2.679666 -1.043140
E -0.598942 -0.787023       NaN       NaN -0.616390

In [57]:
df[df['P']>0][['P','Q']]

          P         Q
A  0.431270  1.192686
C  1.143432  1.012306

In [58]:
df[(df['P']> 0) & df['R']>0][['P','R']]

          P         R
A  0.431270 -0.109203
C  1.143432  0.966802

In [59]:
df

          P         Q         R         S         T
A  0.431270  1.192686 -0.109203  0.570102  0.892391
B -2.114891  1.591057 -0.088394  1.236522 -0.776269
C  1.143432  1.012306  0.966802  1.176011 -0.139158
D -0.230961 -0.943435 -2.819618 -2.679666 -1.043140
E -0.598942 -0.787023  0.088974  0.159062 -0.616390

# how to reset a index in dataset

In [60]:
df.reset_index()

  index         P         Q         R         S         T
0     A  0.431270  1.192686 -0.109203  0.570102  0.892391
1     B -2.114891  1.591057 -0.088394  1.236522 -0.776269
2     C  1.143432  1.012306  0.966802  1.176011 -0.139158
3     D -0.230961 -0.943435 -2.819618 -2.679666 -1.043140
4     E -0.598942 -0.787023  0.088974  0.159062 -0.616390

In [61]:
df

          P         Q         R         S         T
A  0.431270  1.192686 -0.109203  0.570102  0.892391
B -2.114891  1.591057 -0.088394  1.236522 -0.776269
C  1.143432  1.012306  0.966802  1.176011 -0.139158
D -0.230961 -0.943435 -2.819618 -2.679666 -1.043140
E -0.598942 -0.787023  0.088974  0.159062 -0.616390

In [62]:
lst = 'AA BB CC DD EE'.split()

In [63]:
df['Index'] = lst

In [64]:
df

          P         Q         R         S         T Index
A  0.431270  1.192686 -0.109203  0.570102  0.892391    AA
B -2.114891  1.591057 -0.088394  1.236522 -0.776269    BB
C  1.143432  1.012306  0.966802  1.176011 -0.139158    CC
D -0.230961 -0.943435 -2.819618 -2.679666 -1.043140    DD
E -0.598942 -0.787023  0.088974  0.159062 -0.616390    EE

In [65]:
df.set_index('Index')

              P         Q         R         S         T
Index
AA     0.431270  1.192686 -0.109203  0.570102  0.892391
BB    -2.114891  1.591057 -0.088394  1.236522 -0.776269
CC     1.143432  1.012306  0.966802  1.176011 -0.139158
DD    -0.230961 -0.943435 -2.819618 -2.679666 -1.043140
EE    -0.598942 -0.787023  0.088974  0.159062 -0.616390

# Multi index using function

In [66]:
# index levels

outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [67]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [68]:
df = pd.DataFrame(np.random.randn(6,2),index = hier_index,columns = ['A','B'])

In [69]:
df

             A         B
G1 1  1.526041  1.163097
   2 -0.212538  0.980140
   3  0.930840 -0.580355
G2 1  1.929320 -0.144394
   2  0.541968  0.573269
   3  1.261395  2.008477

In [70]:
df.loc['G1'].loc[1:]

          A         B
1  1.526041  1.163097
2 -0.212538  0.980140
3  0.930840 -0.580355

In [71]:
df.loc['G2'].loc[1:]

          A         B
1  1.929320 -0.144394
2  0.541968  0.573269
3  1.261395  2.008477

In [72]:
df.index.names

FrozenList([None, None])

In [73]:
df.index.names = ['Group','Num']

In [74]:
df

                  A         B
Group Num
G1    1    1.526041  1.163097
      2   -0.212538  0.980140
      3    0.930840 -0.580355
G2    1    1.929320 -0.144394
      2    0.541968  0.573269
      3    1.261395  2.008477

In [75]:
df.xs(['G1',2])

C:\Users\dines\AppData\Local\Temp\ipykernel_17440\3186320982.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(['G1',2])

A   -0.212538
B    0.980140
Name: (G1, 2), dtype: float64

In [76]:
df.xs(1,level = 'Num')

              A         B
Group
G1     1.526041  1.163097
G2     1.929320 -0.144394

# To find a Missing values and fillna values

In [77]:
import pandas as pd
import numpy as np

In [78]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [79]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [80]:
df.dropna()

     A    B  C
0  1.0  5.0  1

# access columns axis = 1

In [81]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

# Thresh using allow nan value to given number eg : thresh = 1

In [82]:
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [83]:
df.fillna(value = '***')

     A    B  C
0  1.0  5.0  1
1  2.0  ***  2
2  ***  ***  3

## If u want to change dataset means u compulsory use inplace = True

In [84]:
df['B'].fillna(value = df['C'].mean())

0    5.0
1    2.0
2    2.0
Name: B, dtype: float64

In [85]:
df['C'].mean()

2.0

In [86]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

## Groupby function using to find number avg in one function

In [130]:
data = {'Company':['Google','Google','FB','HCL','ZOHO','ZOHO'],
       'Person':['Dinesh','Surya','Kavin','Gokul','Ragul','Vignesh'],
       'Sales':[200,220,350,360,190,100]}

In [131]:
data

{'Company': ['Google', 'Google', 'FB', 'HCL', 'ZOHO', 'ZOHO'],
 'Person': ['Dinesh', 'Surya', 'Kavin', 'Gokul', 'Ragul', 'Vignesh'],
 'Sales': [200, 220, 350, 360, 190, 100]}

In [132]:
df = pd.DataFrame(data)

In [133]:
df

  Company   Person  Sales
0  Google   Dinesh    200
1  Google    Surya    220
2      FB    Kavin    350
3     HCL    Gokul    360
4    ZOHO    Ragul    190
5    ZOHO  Vignesh    100

In [134]:
df.groupby('Company').mean()

         Sales
Company
FB       350.0
Google   210.0
HCL      360.0
ZOHO     145.0

In [135]:
df.groupby('Company')

In [136]:
d = df.groupby('Company')

In [137]:
d.mean()

         Sales
Company
FB       350.0
Google   210.0
HCL      360.0
ZOHO     145.0

In [138]:
df.groupby('Company').std()

             Sales
Company
FB             NaN
Google   14.142136
HCL            NaN
ZOHO     63.639610

In [139]:
df.groupby('Company').min()

         Person  Sales
Company
FB        Kavin    350
Google   Dinesh    200
HCL       Gokul    360
ZOHO      Ragul    100

In [140]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Kavin    350
Google     Surya    220
HCL        Gokul    360
ZOHO     Vignesh    190

In [141]:
df.groupby('Company').median()

         Sales
Company
FB       350.0
Google   210.0
HCL      360.0
ZOHO     145.0

In [142]:
df.describe()

            Sales
count    6.000000
mean   236.666667
std    100.531919
min    100.000000
25%    192.500000
50%    210.000000
75%    317.500000
max    360.000000

In [143]:
df.groupby('Company').count()

         Person  Sales
Company
FB            1      1
Google        2      2
HCL           1      1
ZOHO          2      2

In [144]:
df.groupby('Company').sum()

         Sales
Company
FB         350
Google     420
HCL        360
ZOHO       290

In [145]:
df.groupby('Company').value_counts()

Company  Person   Sales
FB       Kavin    350      1
Google   Dinesh   200      1
         Surya    220      1
HCL      Gokul    360      1
ZOHO     Ragul    190      1
         Vignesh  100      1
dtype: int64

# Merging, Joining, and Concantenating

In [146]:
import pandas as pd

In [147]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [148]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [149]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [150]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [151]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [152]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## To join a two dataframe means we use[ concat key] for dataframe

In [153]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [154]:
pd.concat([df1,df2,df3],axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

# Merging Example DataFrames

In [155]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [156]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [157]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [158]:
pd.merge(left,right,how = 'inner',on ='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

### Or to show a more complicated example:

In [159]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [160]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [161]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [162]:
pd.merge(left,right,on = ['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [163]:
pd.merge(left,right,how = 'outer',on = ['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [164]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

# Joining

In [165]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [166]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [167]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [168]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [169]:
left.join(right,how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [170]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [171]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [172]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [173]:
df['col2'].nunique()

3

In [174]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [175]:
df[df['col1'] == 2]

   col1  col2 col3
1     2   555  def

In [176]:
def sq(d):
    return d **2

In [177]:
df['col1'].apply(sq)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [178]:
df['col2'].apply(sq)

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

In [179]:
df['col2'].sum()

2109

In [180]:
del df['col1']

In [181]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [182]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [183]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [184]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [185]:
df.sort_values(by = 'col2',inplace = True)

In [186]:
df

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [187]:
df.isna().sum()

col2    0
col3    0
dtype: int64

In [188]:
df.dropna()

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [189]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

### ** Filling in NaN values with something else: **

In [190]:
df.fillna('@@')

  col1   col2 col3
0  1.0     @@  abc
1  2.0  555.0  def
2  3.0  666.0  ghi
3   @@  444.0  xyz

In [191]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [192]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [193]:
df.pivot_table(values = 'D',index = ['A','B'],columns ='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data input and ouput

# CSV

In [200]:
df = pd.read_csv('example.txt')

In [201]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [202]:
ls

 Volume in drive C is Local Disk
 Volume Serial Number is 90A7-8E7A

 Directory of C:\Users\dines\data science\Pandas

04/13/2023  08:48 PM    <DIR>          .
04/12/2023  04:35 PM    <DIR>          ..
04/13/2023  08:44 PM    <DIR>          .ipynb_checkpoints
04/13/2023  11:32 AM    <DIR>          DV - Pandas Bulit in
04/13/2023  08:49 PM                87 example.txt
04/05/2023  04:44 PM             5,508 Excel_Sample.xlsx
04/06/2023  05:49 PM            36,386 Exersice - Pandas.ipynb
04/13/2023  08:48 PM           216,375 Explaination - Pandas.ipynb
01/19/2023  05:45 PM             4,551 iris_data.csv
01/19/2023  05:29 PM             2,998 iris_names.csv
04/05/2023  04:47 PM               560 multi_index_example.txt
04/06/2023  02:00 PM        16,239,776 Salaries.csv
04/04/2023  04:52 PM            18,269 utube link.ipynb
               9 File(s)     16,524,510 bytes
               4 Dir(s)  121,072,750,592 bytes free

In [203]:
df.to_csv('example.txt',index=False)

In [204]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

# Excel

In [205]:
pd.read_excel('Excel_Sample.xlsx',sheet_name ='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15